Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128GM604.h
#define _TSCON_TSE1_POSITION                     0x00000001
#define _TSCON_TSE1_MASK                         0x00000002
#define _TSCON_TSE1_LENGTH                       0x00000001

#define _TSCON_TSE2_POSITION                     0x00000002
#define _TSCON_TSE2_MASK                         0x00000004
#define _TSCON_TSE2_LENGTH                       0x00000001

#define _TSCON_TSE3_POSITION                     0x00000003
#define _TSCON_TSE3_MASK                         0x00000008
#define _TSCON_TSE3_LENGTH                       0x00000001

#define _TSCON_TSE4_POSITION                     0x00000004
#define _TSCON_TSE4_MASK                         0x00000010
#define _TSCON_TSE4_LENGTH                       0x00000001

#define _TSCON_TSE5_POSITION                     0x00000005
#define _TSCON_TSE5_MASK                         0x00000020
#define _TSCON_TSE5_LENGTH                       0x00000001

#define _TSCON_TSE6_POSITION                     0x00000006
#define _TSCON_TSE6_MASK                         0x00000040
#define _TSCON_TSE6_LENGTH                       0x00000001

#define _TSCON_TSE7_POSITION                     0x00000007
#define _TSCON_TSE7_MASK                         0x00000080
#define _TSCON_TSE7_LENGTH                       0x00000001

#define _TSCON_TSE8_POSITION                     0x00000008
#define _TSCON_TSE8_MASK                         0x00000100
#define _TSCON_TSE8_LENGTH                       0x00000001

#define _TSCON_TSE9_POSITION                     0x00000009
#define _TSCON_TSE9_MASK                         0x00000200
#define _TSCON_TSE9_LENGTH                       0x00000001

#define _TSCON_TSE10_POSITION                    0x0000000A
#define _TSCON_TSE10_MASK                        0x00000400
#define _TSCON_TSE10_LENGTH                      0x00000001

#define _TSCON_TSE11_POSITION                    0x0000000B
#define _TSCON_TSE11_MASK                        0x00000800
#define _TSCON_TSE11_LENGTH                      0x00000001

#define _TSCON_TSE12_POSITION                    0x0000000C
#define _TSCON_TSE12_MASK                        0x00001000
#define _TSCON_TSE12_LENGTH                      0x00000001

#define _TSCON_TSE13_POSITION                    0x0000000D
#define _TSCON_TSE13_MASK                        0x00002000
#define _TSCON_TSE13_LENGTH                      0x00000001

#define _TSCON_TSE14_POSITION                    0x0000000E
#define _TSCON_TSE14_MASK                        0x00004000
#define _TSCON_TSE14_LENGTH                      0x00000001

#define _TSCON_TSE15_POSITION                    0x0000000F
#define _TSCON_TSE15_MASK                        0x00008000
#define _TSCON_TSE15_LENGTH                      0x00000001

#define _RSCON_RSE0_POSITION                     0x00000000
#define _RSCON_RSE0_MASK                         0x00000001
#define _RSCON_RSE0_LENGTH                       0x00000001

#define _RSCON_RSE1_POSITION                     0x00000001
#define _RSCON_RSE1_MASK                         0x00000002
#define _RSCON_RSE1_LENGTH                       0x00000001

#define _RSCON_RSE2_POSITION                     0x00000002
#define _RSCON_RSE2_MASK                         0x00000004
#define _RSCON_RSE2_LENGTH                       0x00000001

#define _RSCON_RSE3_POSITION                     0x00000003
#define _RSCON_RSE3_MASK                         0x00000008
#define _RSCON_RSE3_LENGTH                       0x00000001

#define _RSCON_RSE4_POSITION                     0x00000004
#define _RSCON_RSE4_MASK                         0x00000010
#define _RSCON_RSE4_LENGTH                       0x00000001

#define _RSCON_RSE5_POSITION                     0x00000005
#define _RSCON_RSE5_MASK                         0x00000020
#define _RSCON_RSE5_LENGTH                       0x00000001

#define _RSCON_RSE6_POSITION                     0x00000006
#define _RSCON_RSE6_MASK                         0x00000040
#define _RSCON_RSE6_LENGTH                       0x00000001

#define _RSCON_RSE7_POSITION                     0x00000007
#define _RSCON_RSE7_MASK                         0x00000080
#define _RSCON_RSE7_LENGTH                       0x00000001

#define _RSCON_RSE8_POSITION                     0x00000008
#define _RSCON_RSE8_MASK                         0x00000100
#define _RSCON_RSE8_LENGTH                       0x00000001

#define _RSCON_RSE9_POSITION                     0x00000009
#define _RSCON_RSE9_MASK                         0x00000200
#define _RSCON_RSE9_LENGTH                       0x00000001

#define _RSCON_RSE10_POSITION                    0x0000000A
#define _RSCON_RSE10_MASK                        0x00000400
#define _RSCON_RSE10_LENGTH                      0x00000001

#define _RSCON_RSE11_POSITION                    0x0000000B
#define _RSCON_RSE11_MASK                        0x00000800
#define _RSCON_RSE11_LENGTH                      0x00000001

#define _RSCON_RSE12_POSITION                    0x0000000C
#define _RSCON_RSE12_MASK                        0x00001000
#define _RSCON_RSE12_LENGTH                      0x00000001

#define _RSCON_RSE13_POSITION                    0x0000000D
#define _RSCON_RSE13_MASK                        0x00002000
#define _RSCON_RSE13_LENGTH                      0x00000001

#define _RSCON_RSE14_POSITION                    0x0000000E
#define _RSCON_RSE14_MASK                        0x00004000
#define _RSCON_RSE14_LENGTH                      0x00000001

#define _RSCON_RSE15_POSITION                    0x0000000F
#define _RSCON_RSE15_MASK                        0x00008000
#define _RSCON_RSE15_LENGTH                      0x00000001

#define _SPI3STAT_SPIRBF_POSITION                0x00000000
#define _SPI3STAT_SPIRBF_MASK                    0x00000001
#define _SPI3STAT_SPIRBF_LENGTH                  0x00000001

#define _SPI3STAT_SPITBF_POSITION                0x00000001
#define _SPI3STAT_SPITBF_MASK                    0x00000002
#define _SPI3STAT_SPITBF_LENGTH                  0x00000001

#define _SPI3STAT_SISEL_POSITION                 0x00000002
#define _SPI3STAT_SISEL_MASK                     0x0000001C
#define _SPI3STAT_SISEL_LENGTH                   0x00000003

#define _SPI3STAT_SRXMPT_POSITION                0x00000005
#define _SPI3STAT_SRXMPT_MASK                    0x00000020
#define _SPI3STAT_SRXMPT_LENGTH                  0x00000001

