Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128GM604.h
#define _C1RXF15EID_EID12_POSITION               0x0000000C
#define _C1RXF15EID_EID12_MASK                   0x00001000
#define _C1RXF15EID_EID12_LENGTH                 0x00000001

#define _C1RXF15EID_EID13_POSITION               0x0000000D
#define _C1RXF15EID_EID13_MASK                   0x00002000
#define _C1RXF15EID_EID13_LENGTH                 0x00000001

#define _C1RXF15EID_EID14_POSITION               0x0000000E
#define _C1RXF15EID_EID14_MASK                   0x00004000
#define _C1RXF15EID_EID14_LENGTH                 0x00000001

#define _C1RXF15EID_EID15_POSITION               0x0000000F
#define _C1RXF15EID_EID15_MASK                   0x00008000
#define _C1RXF15EID_EID15_LENGTH                 0x00000001

#define _C1RXF15EID_EID_POSITION                 0x00000000
#define _C1RXF15EID_EID_MASK                     0x0000FFFF
#define _C1RXF15EID_EID_LENGTH                   0x00000010

#define _C2CTRL1_WIN_POSITION                    0x00000000
#define _C2CTRL1_WIN_MASK                        0x00000001
#define _C2CTRL1_WIN_LENGTH                      0x00000001

#define _C2CTRL1_CANCAP_POSITION                 0x00000003
#define _C2CTRL1_CANCAP_MASK                     0x00000008
#define _C2CTRL1_CANCAP_LENGTH                   0x00000001

#define _C2CTRL1_OPMODE_POSITION                 0x00000005
#define _C2CTRL1_OPMODE_MASK                     0x000000E0
#define _C2CTRL1_OPMODE_LENGTH                   0x00000003

#define _C2CTRL1_REQOP_POSITION                  0x00000008
#define _C2CTRL1_REQOP_MASK                      0x00000700
#define _C2CTRL1_REQOP_LENGTH                    0x00000003

#define _C2CTRL1_CANCKS_POSITION                 0x0000000B
#define _C2CTRL1_CANCKS_MASK                     0x00000800
#define _C2CTRL1_CANCKS_LENGTH                   0x00000001

#define _C2CTRL1_ABAT_POSITION                   0x0000000C
#define _C2CTRL1_ABAT_MASK                       0x00001000
#define _C2CTRL1_ABAT_LENGTH                     0x00000001

#define _C2CTRL1_CSIDL_POSITION                  0x0000000D
#define _C2CTRL1_CSIDL_MASK                      0x00002000
#define _C2CTRL1_CSIDL_LENGTH                    0x00000001

#define _C2CTRL1_OPMODE0_POSITION                0x00000005
#define _C2CTRL1_OPMODE0_MASK                    0x00000020
#define _C2CTRL1_OPMODE0_LENGTH                  0x00000001

#define _C2CTRL1_OPMODE1_POSITION                0x00000006
#define _C2CTRL1_OPMODE1_MASK                    0x00000040
#define _C2CTRL1_OPMODE1_LENGTH                  0x00000001

#define _C2CTRL1_OPMODE2_POSITION                0x00000007
#define _C2CTRL1_OPMODE2_MASK                    0x00000080
#define _C2CTRL1_OPMODE2_LENGTH                  0x00000001

#define _C2CTRL1_REQOP0_POSITION                 0x00000008
#define _C2CTRL1_REQOP0_MASK                     0x00000100
#define _C2CTRL1_REQOP0_LENGTH                   0x00000001

#define _C2CTRL1_REQOP1_POSITION                 0x00000009
#define _C2CTRL1_REQOP1_MASK                     0x00000200
#define _C2CTRL1_REQOP1_LENGTH                   0x00000001

#define _C2CTRL1_REQOP2_POSITION                 0x0000000A
#define _C2CTRL1_REQOP2_MASK                     0x00000400
#define _C2CTRL1_REQOP2_LENGTH                   0x00000001

#define _C2CTRL2_DNCNT_POSITION                  0x00000000
#define _C2CTRL2_DNCNT_MASK                      0x0000001F
#define _C2CTRL2_DNCNT_LENGTH                    0x00000005

#define _C2CTRL2_DNCNT0_POSITION                 0x00000000
#define _C2CTRL2_DNCNT0_MASK                     0x00000001
#define _C2CTRL2_DNCNT0_LENGTH                   0x00000001

#define _C2CTRL2_DNCNT1_POSITION                 0x00000001
#define _C2CTRL2_DNCNT1_MASK                     0x00000002
#define _C2CTRL2_DNCNT1_LENGTH                   0x00000001

#define _C2CTRL2_DNCNT2_POSITION                 0x00000002
#define _C2CTRL2_DNCNT2_MASK                     0x00000004
#define _C2CTRL2_DNCNT2_LENGTH                   0x00000001

#define _C2CTRL2_DNCNT3_POSITION                 0x00000003
#define _C2CTRL2_DNCNT3_MASK                     0x00000008
#define _C2CTRL2_DNCNT3_LENGTH                   0x00000001

#define _C2CTRL2_DNCNT4_POSITION                 0x00000004
#define _C2CTRL2_DNCNT4_MASK                     0x00000010
#define _C2CTRL2_DNCNT4_LENGTH                   0x00000001

#define _C2VEC_ICODE_POSITION                    0x00000000
#define _C2VEC_ICODE_MASK                        0x0000007F
#define _C2VEC_ICODE_LENGTH                      0x00000007

#define _C2VEC_FILHIT_POSITION                   0x00000008
#define _C2VEC_FILHIT_MASK                       0x00001F00
#define _C2VEC_FILHIT_LENGTH                     0x00000005

#define _C2VEC_ICODE0_POSITION                   0x00000000
#define _C2VEC_ICODE0_MASK                       0x00000001
#define _C2VEC_ICODE0_LENGTH                     0x00000001

#define _C2VEC_ICODE1_POSITION                   0x00000001
#define _C2VEC_ICODE1_MASK                       0x00000002
#define _C2VEC_ICODE1_LENGTH                     0x00000001

#define _C2VEC_ICODE2_POSITION                   0x00000002
#define _C2VEC_ICODE2_MASK                       0x00000004
#define _C2VEC_ICODE2_LENGTH                     0x00000001

#define _C2VEC_ICODE3_POSITION                   0x00000003
#define _C2VEC_ICODE3_MASK                       0x00000008
#define _C2VEC_ICODE3_LENGTH                     0x00000001

#define _C2VEC_ICODE4_POSITION                   0x00000004
#define _C2VEC_ICODE4_MASK                       0x00000010
#define _C2VEC_ICODE4_LENGTH                     0x00000001

#define _C2VEC_ICODE5_POSITION                   0x00000005
#define _C2VEC_ICODE5_MASK                       0x00000020
#define _C2VEC_ICODE5_LENGTH                     0x00000001

#define _C2VEC_ICODE6_POSITION                   0x00000006
#define _C2VEC_ICODE6_MASK                       0x00000040
#define _C2VEC_ICODE6_LENGTH                     0x00000001

#define _C2VEC_FILHIT0_POSITION                  0x00000008
#define _C2VEC_FILHIT0_MASK                      0x00000100
#define _C2VEC_FILHIT0_LENGTH                    0x00000001

