Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128GM604.h
#define _C2INTF_TXBP_POSITION                    0x0000000C
#define _C2INTF_TXBP_MASK                        0x00001000
#define _C2INTF_TXBP_LENGTH                      0x00000001

#define _C2INTF_TXBO_POSITION                    0x0000000D
#define _C2INTF_TXBO_MASK                        0x00002000
#define _C2INTF_TXBO_LENGTH                      0x00000001

#define _C2INTE_TBIE_POSITION                    0x00000000
#define _C2INTE_TBIE_MASK                        0x00000001
#define _C2INTE_TBIE_LENGTH                      0x00000001

#define _C2INTE_RBIE_POSITION                    0x00000001
#define _C2INTE_RBIE_MASK                        0x00000002
#define _C2INTE_RBIE_LENGTH                      0x00000001

#define _C2INTE_RBOVIE_POSITION                  0x00000002
#define _C2INTE_RBOVIE_MASK                      0x00000004
#define _C2INTE_RBOVIE_LENGTH                    0x00000001

#define _C2INTE_FIFOIE_POSITION                  0x00000003
#define _C2INTE_FIFOIE_MASK                      0x00000008
#define _C2INTE_FIFOIE_LENGTH                    0x00000001

#define _C2INTE_ERRIE_POSITION                   0x00000005
#define _C2INTE_ERRIE_MASK                       0x00000020
#define _C2INTE_ERRIE_LENGTH                     0x00000001

#define _C2INTE_WAKIE_POSITION                   0x00000006
#define _C2INTE_WAKIE_MASK                       0x00000040
#define _C2INTE_WAKIE_LENGTH                     0x00000001

#define _C2INTE_IVRIE_POSITION                   0x00000007
#define _C2INTE_IVRIE_MASK                       0x00000080
#define _C2INTE_IVRIE_LENGTH                     0x00000001

#define _C2EC_RERRCNT_POSITION                   0x00000000
#define _C2EC_RERRCNT_MASK                       0x000000FF
#define _C2EC_RERRCNT_LENGTH                     0x00000008

#define _C2EC_TERRCNT_POSITION                   0x00000008
#define _C2EC_TERRCNT_MASK                       0x0000FF00
#define _C2EC_TERRCNT_LENGTH                     0x00000008

#define _C2CFG1_BRP_POSITION                     0x00000000
#define _C2CFG1_BRP_MASK                         0x0000003F
#define _C2CFG1_BRP_LENGTH                       0x00000006

#define _C2CFG1_SJW_POSITION                     0x00000006
#define _C2CFG1_SJW_MASK                         0x000000C0
#define _C2CFG1_SJW_LENGTH                       0x00000002

#define _C2CFG1_BRP0_POSITION                    0x00000000
#define _C2CFG1_BRP0_MASK                        0x00000001
#define _C2CFG1_BRP0_LENGTH                      0x00000001

#define _C2CFG1_BRP1_POSITION                    0x00000001
#define _C2CFG1_BRP1_MASK                        0x00000002
#define _C2CFG1_BRP1_LENGTH                      0x00000001

#define _C2CFG1_BRP2_POSITION                    0x00000002
#define _C2CFG1_BRP2_MASK                        0x00000004
#define _C2CFG1_BRP2_LENGTH                      0x00000001

#define _C2CFG1_BRP3_POSITION                    0x00000003
#define _C2CFG1_BRP3_MASK                        0x00000008
#define _C2CFG1_BRP3_LENGTH                      0x00000001

#define _C2CFG1_BRP4_POSITION                    0x00000004
#define _C2CFG1_BRP4_MASK                        0x00000010
#define _C2CFG1_BRP4_LENGTH                      0x00000001

#define _C2CFG1_BRP5_POSITION                    0x00000005
#define _C2CFG1_BRP5_MASK                        0x00000020
#define _C2CFG1_BRP5_LENGTH                      0x00000001

#define _C2CFG1_SJW0_POSITION                    0x00000006
#define _C2CFG1_SJW0_MASK                        0x00000040
#define _C2CFG1_SJW0_LENGTH                      0x00000001

#define _C2CFG1_SJW1_POSITION                    0x00000007
#define _C2CFG1_SJW1_MASK                        0x00000080
#define _C2CFG1_SJW1_LENGTH                      0x00000001

#define _C2CFG2_PRSEG_POSITION                   0x00000000
#define _C2CFG2_PRSEG_MASK                       0x00000007
#define _C2CFG2_PRSEG_LENGTH                     0x00000003

#define _C2CFG2_SEG1PH_POSITION                  0x00000003
#define _C2CFG2_SEG1PH_MASK                      0x00000038
#define _C2CFG2_SEG1PH_LENGTH                    0x00000003

#define _C2CFG2_SAM_POSITION                     0x00000006
#define _C2CFG2_SAM_MASK                         0x00000040
#define _C2CFG2_SAM_LENGTH                       0x00000001

#define _C2CFG2_SEG2PHTS_POSITION                0x00000007
#define _C2CFG2_SEG2PHTS_MASK                    0x00000080
#define _C2CFG2_SEG2PHTS_LENGTH                  0x00000001

#define _C2CFG2_SEG2PH_POSITION                  0x00000008
#define _C2CFG2_SEG2PH_MASK                      0x00000700
#define _C2CFG2_SEG2PH_LENGTH                    0x00000003

#define _C2CFG2_WAKFIL_POSITION                  0x0000000E
#define _C2CFG2_WAKFIL_MASK                      0x00004000
#define _C2CFG2_WAKFIL_LENGTH                    0x00000001

#define _C2CFG2_PRSEG0_POSITION                  0x00000000
#define _C2CFG2_PRSEG0_MASK                      0x00000001
#define _C2CFG2_PRSEG0_LENGTH                    0x00000001

#define _C2CFG2_PRSEG1_POSITION                  0x00000001
#define _C2CFG2_PRSEG1_MASK                      0x00000002
#define _C2CFG2_PRSEG1_LENGTH                    0x00000001

#define _C2CFG2_PRSEG2_POSITION                  0x00000002
#define _C2CFG2_PRSEG2_MASK                      0x00000004
#define _C2CFG2_PRSEG2_LENGTH                    0x00000001

#define _C2CFG2_SEG1PH0_POSITION                 0x00000003
#define _C2CFG2_SEG1PH0_MASK                     0x00000008
#define _C2CFG2_SEG1PH0_LENGTH                   0x00000001

#define _C2CFG2_SEG1PH1_POSITION                 0x00000004
#define _C2CFG2_SEG1PH1_MASK                     0x00000010
#define _C2CFG2_SEG1PH1_LENGTH                   0x00000001

#define _C2CFG2_SEG1PH2_POSITION                 0x00000005
#define _C2CFG2_SEG1PH2_MASK                     0x00000020
#define _C2CFG2_SEG1PH2_LENGTH                   0x00000001

#define _C2CFG2_SEG2PH0_POSITION                 0x00000008
#define _C2CFG2_SEG2PH0_MASK                     0x00000100
#define _C2CFG2_SEG2PH0_LENGTH                   0x00000001

#define _C2CFG2_SEG2PH1_POSITION                 0x00000009
#define _C2CFG2_SEG2PH1_MASK                     0x00000200
#define _C2CFG2_SEG2PH1_LENGTH                   0x00000001

