Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128GM604.h
#define _FCLCON6_IFLTMOD_POSITION                0x0000000F
#define _FCLCON6_IFLTMOD_MASK                    0x00008000
#define _FCLCON6_IFLTMOD_LENGTH                  0x00000001

#define _FCLCON6_FLTMOD0_POSITION                0x00000000
#define _FCLCON6_FLTMOD0_MASK                    0x00000001
#define _FCLCON6_FLTMOD0_LENGTH                  0x00000001

#define _FCLCON6_FLTMOD1_POSITION                0x00000001
#define _FCLCON6_FLTMOD1_MASK                    0x00000002
#define _FCLCON6_FLTMOD1_LENGTH                  0x00000001

#define _FCLCON6_FLTSRC0_POSITION                0x00000003
#define _FCLCON6_FLTSRC0_MASK                    0x00000008
#define _FCLCON6_FLTSRC0_LENGTH                  0x00000001

#define _FCLCON6_FLTSRC1_POSITION                0x00000004
#define _FCLCON6_FLTSRC1_MASK                    0x00000010
#define _FCLCON6_FLTSRC1_LENGTH                  0x00000001

#define _FCLCON6_FLTSRC2_POSITION                0x00000005
#define _FCLCON6_FLTSRC2_MASK                    0x00000020
#define _FCLCON6_FLTSRC2_LENGTH                  0x00000001

#define _FCLCON6_FLTSRC3_POSITION                0x00000006
#define _FCLCON6_FLTSRC3_MASK                    0x00000040
#define _FCLCON6_FLTSRC3_LENGTH                  0x00000001

#define _FCLCON6_FLTSRC4_POSITION                0x00000007
#define _FCLCON6_FLTSRC4_MASK                    0x00000080
#define _FCLCON6_FLTSRC4_LENGTH                  0x00000001

#define _FCLCON6_CLSRC0_POSITION                 0x0000000A
#define _FCLCON6_CLSRC0_MASK                     0x00000400
#define _FCLCON6_CLSRC0_LENGTH                   0x00000001

#define _FCLCON6_CLSRC1_POSITION                 0x0000000B
#define _FCLCON6_CLSRC1_MASK                     0x00000800
#define _FCLCON6_CLSRC1_LENGTH                   0x00000001

#define _FCLCON6_CLSRC2_POSITION                 0x0000000C
#define _FCLCON6_CLSRC2_MASK                     0x00001000
#define _FCLCON6_CLSRC2_LENGTH                   0x00000001

#define _FCLCON6_CLSRC3_POSITION                 0x0000000D
#define _FCLCON6_CLSRC3_MASK                     0x00002000
#define _FCLCON6_CLSRC3_LENGTH                   0x00000001

#define _FCLCON6_CLSRC4_POSITION                 0x0000000E
#define _FCLCON6_CLSRC4_MASK                     0x00004000
#define _FCLCON6_CLSRC4_LENGTH                   0x00000001

#define _TRIG6_TRGCMP_POSITION                   0x00000003
#define _TRIG6_TRGCMP_MASK                       0x0000FFF8
#define _TRIG6_TRGCMP_LENGTH                     0x0000000D

#define _TRIG6_TRGCMP0_POSITION                  0x00000003
#define _TRIG6_TRGCMP0_MASK                      0x00000008
#define _TRIG6_TRGCMP0_LENGTH                    0x00000001

#define _TRIG6_TRGCMP1_POSITION                  0x00000004
#define _TRIG6_TRGCMP1_MASK                      0x00000010
#define _TRIG6_TRGCMP1_LENGTH                    0x00000001

#define _TRIG6_TRGCMP2_POSITION                  0x00000005
#define _TRIG6_TRGCMP2_MASK                      0x00000020
#define _TRIG6_TRGCMP2_LENGTH                    0x00000001

#define _TRIG6_TRGCMP3_POSITION                  0x00000006
#define _TRIG6_TRGCMP3_MASK                      0x00000040
#define _TRIG6_TRGCMP3_LENGTH                    0x00000001

#define _TRIG6_TRGCMP4_POSITION                  0x00000007
#define _TRIG6_TRGCMP4_MASK                      0x00000080
#define _TRIG6_TRGCMP4_LENGTH                    0x00000001

#define _TRIG6_TRGCMP5_POSITION                  0x00000008
#define _TRIG6_TRGCMP5_MASK                      0x00000100
#define _TRIG6_TRGCMP5_LENGTH                    0x00000001

#define _TRIG6_TRGCMP6_POSITION                  0x00000009
#define _TRIG6_TRGCMP6_MASK                      0x00000200
#define _TRIG6_TRGCMP6_LENGTH                    0x00000001

#define _TRIG6_TRGCMP7_POSITION                  0x0000000A
#define _TRIG6_TRGCMP7_MASK                      0x00000400
#define _TRIG6_TRGCMP7_LENGTH                    0x00000001

#define _TRIG6_TRGCMP8_POSITION                  0x0000000B
#define _TRIG6_TRGCMP8_MASK                      0x00000800
#define _TRIG6_TRGCMP8_LENGTH                    0x00000001

#define _TRIG6_TRGCMP9_POSITION                  0x0000000C
#define _TRIG6_TRGCMP9_MASK                      0x00001000
#define _TRIG6_TRGCMP9_LENGTH                    0x00000001

#define _TRIG6_TRGCMP10_POSITION                 0x0000000D
#define _TRIG6_TRGCMP10_MASK                     0x00002000
#define _TRIG6_TRGCMP10_LENGTH                   0x00000001

#define _TRIG6_TRGCMP11_POSITION                 0x0000000E
#define _TRIG6_TRGCMP11_MASK                     0x00004000
#define _TRIG6_TRGCMP11_LENGTH                   0x00000001

#define _TRIG6_TRGCMP12_POSITION                 0x0000000F
#define _TRIG6_TRGCMP12_MASK                     0x00008000
#define _TRIG6_TRGCMP12_LENGTH                   0x00000001

#define _TRGCON6_TRGSTRT_POSITION                0x00000000
#define _TRGCON6_TRGSTRT_MASK                    0x0000003F
#define _TRGCON6_TRGSTRT_LENGTH                  0x00000006

#define _TRGCON6_DTM_POSITION                    0x00000007
#define _TRGCON6_DTM_MASK                        0x00000080
#define _TRGCON6_DTM_LENGTH                      0x00000001

#define _TRGCON6_TRGDIV_POSITION                 0x0000000C
#define _TRGCON6_TRGDIV_MASK                     0x0000F000
#define _TRGCON6_TRGDIV_LENGTH                   0x00000004

#define _TRGCON6_TRGSTRT0_POSITION               0x00000000
#define _TRGCON6_TRGSTRT0_MASK                   0x00000001
#define _TRGCON6_TRGSTRT0_LENGTH                 0x00000001

#define _TRGCON6_TRGSTRT1_POSITION               0x00000001
#define _TRGCON6_TRGSTRT1_MASK                   0x00000002
#define _TRGCON6_TRGSTRT1_LENGTH                 0x00000001

#define _TRGCON6_TRGSTRT2_POSITION               0x00000002
#define _TRGCON6_TRGSTRT2_MASK                   0x00000004
#define _TRGCON6_TRGSTRT2_LENGTH                 0x00000001

#define _TRGCON6_TRGSTRT3_POSITION               0x00000003
#define _TRGCON6_TRGSTRT3_MASK                   0x00000008
#define _TRGCON6_TRGSTRT3_LENGTH                 0x00000001

#define _TRGCON6_TRGSTRT4_POSITION               0x00000004
#define _TRGCON6_TRGSTRT4_MASK                   0x00000010
#define _TRGCON6_TRGSTRT4_LENGTH                 0x00000001

